import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-services',
  templateUrl: './services.component.html',
  styleUrls: ['./services.component.css']
})
export class ServicesComponent implements OnInit {
  // data from web service  will pass  to servicesObj
  servicsObj = [
    {
        title:'نص لوريم إيبسوم القياسي والمستخدم',
        description:'لوريم إيبسوم هو ببساطة نص شكلي (بمعنى أن الغاية هي الشكل وليس المحتوى)ويستخدم في صناعات المطابع ودور النشر. كان لوريم ايبسوم ولازال'
    },
    {
        title:'نص لوريم إيبسوم القياسي والمستخدم',
        description:'لوريم إيبسوم هو ببساطة نص شكلي (بمعنى أن الغاية هي الشكل وليس المحتوى)ويستخدم في صناعات المطابع ودور النشر. كان لوريم ايبسوم ولازال'
    },
    {
        title:'نص لوريم إيبسوم القياسي والمستخدم',
        description:'لوريم إيبسوم هو ببساطة نص شكلي (بمعنى أن الغاية هي الشكل وليس المحتوى)ويستخدم في صناعات المطابع ودور النشر. كان لوريم ايبسوم ولازال'
    },
    {
        title:'نص لوريم إيبسوم القياسي والمستخدم',
        description:'لوريم إيبسوم هو ببساطة نص شكلي (بمعنى أن الغاية هي الشكل وليس المحتوى)ويستخدم في صناعات المطابع ودور النشر. كان لوريم ايبسوم ولازال'
    },
    {
        title:'نص لوريم إيبسوم القياسي والمستخدم',
        description:'لوريم إيبسوم هو ببساطة نص شكلي (بمعنى أن الغاية هي الشكل وليس المحتوى)ويستخدم في صناعات المطابع ودور النشر. كان لوريم ايبسوم ولازال'
    },
    {
        title:'نص لوريم إيبسوم القياسي والمستخدم',
        description:'لوريم إيبسوم هو ببساطة نص شكلي (بمعنى أن الغاية هي الشكل وليس المحتوى)ويستخدم في صناعات المطابع ودور النشر. كان لوريم ايبسوم ولازال'
    },
    {
        title:'نص لوريم إيبسوم القياسي والمستخدم',
        description:'لوريم إيبسوم هو ببساطة نص شكلي (بمعنى أن الغاية هي الشكل وليس المحتوى)ويستخدم في صناعات المطابع ودور النشر. كان لوريم ايبسوم ولازال'
    },
    {
        title:'نص لوريم إيبسوم القياسي والمستخدم',
        description:'لوريم إيبسوم هو ببساطة نص شكلي (بمعنى أن الغاية هي الشكل وليس المحتوى)ويستخدم في صناعات المطابع ودور النشر. كان لوريم ايبسوم ولازال'
    },
    {
        title:'نص لوريم إيبسوم القياسي والمستخدم',
        description:'لوريم إيبسوم هو ببساطة نص شكلي (بمعنى أن الغاية هي الشكل وليس المحتوى)ويستخدم في صناعات المطابع ودور النشر. كان لوريم ايبسوم ولازال'
    },
    {
        title:'نص لوريم إيبسوم القياسي والمستخدم',
        description:'لوريم إيبسوم هو ببساطة نص شكلي (بمعنى أن الغاية هي الشكل وليس المحتوى)ويستخدم في صناعات المطابع ودور النشر. كان لوريم ايبسوم ولازال'
    }
];

  constructor() { }
 
  ngOnInit() {
    
  }

}
